Tekla.Structures.ModelInternal.dotConversionLink_t
Serialization structure for conversion link.

Tekla.Structures.ModelInternal.dotConversionLink_t.PartId
Linked part ID.

Tekla.Structures.ModelInternal.dotConversionLink_t.RefModelId
Reference model ID.

Tekla.Structures.ModelInternal.dotConversionLink_t.RefModelObjectId
Reference model object ID.

Tekla.Structures.ModelInternal.dotConversionLink_t.ApprovalStatus
Approval status for conversion.

Tekla.Structures.ModelInternal.dotConversionLink_t.ConversionStatus
Conversion status.